### [군집데이터]

In [13]:
True == False

False

In [35]:
True != 0

True

In [15]:
False == 0

True

In [26]:
True or False

True

In [33]:
1 =='1'

False

In [34]:
eng = 'Korea COVID 19'
eng.lower()

'korea covid 19'

In [5]:
eng.upper()

'KOREA COVID 19'

In [543]:
data=[]
data.append('java')
print(data[0],data[-1],data[1:],data[:2])
data.sort()
print(data)
data.reverse()
print(data)

java java [] ['java']
['java']
['java']

In [551]:
b=(1,2,3,'사','오')
c=1,2,3
type(b) type(c)
b[3] = 4
b[3:],b[1:4]

In [552]:
type(b)

tuple

In [8]:
dic = {'name1' : '경민', '학번1':20103, 'name2' : '경민2', '학번2':20104}
dic.get('name1')

'경민'

In [9]:
dic.keys()

dict_keys(['name1', '학번1', 'name2', '학번2'])

In [553]:
dic.values()

dict_values(['경민', 20103, '경민2', 20104])

In [555]:
import pandas as pd

In [556]:
li=[1,2,3]
li

[1, 2, 3]

In [571]:
type(li)

list

In [572]:
pd.core.series.Series(li)

0    1
1    2
2    3
dtype: int64

In [574]:
s2=pd.core.series.Series(['일','이','삼'])
s2

0    일
1    이
2    삼
dtype: object

In [575]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [584]:
data = pd.DataFrame([['a' , 100 ],['b' , 200 ],['c' , 300]])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
0    3 non-null object
1    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [586]:
data.head(2)

   0    1
0  a  100
1  b  200

In [588]:
data.tail(2)

   0    1
1  b  200
2  c  300

In [589]:
col=['1군','2군']

In [592]:
pd.DataFrame([['a' , 100 ],['b' , 200 ],['c' , 300]],columns=col)

  1군   2군
0  a  100
1  b  200
2  c  300

In [604]:
man=[{'name1':'경민' , '학번1':20103},
     {'name2':'경민2' , '학번2':20104}]
pd.DataFrame(man)

  name1      학번1 name2      학번2
0    경민  20103.0   NaN      NaN
1   NaN      NaN   경민2  20104.0

In [608]:
a=[1,2,3]
b=[4,5,6]
df=[a,b]
dd=pd.DataFrame(df,index=[1,2],columns=['A','B','C'])
dd

   A  B  C
1  1  2  3
2  4  5  6